<?php
/**
 *  * 统一格式：A-BB-CCC
 * A:错误级别,0代表成功，1代表系统级错误，2代表服务（业务）级错误；
 * B:项目/模块/分类名称；
 * C:具体错误编号；
 *
 * controller层使用的错误码：服务（业务）级错误码（该错误码会返回给接口使用者）
 *
 * service、repository、model层使用的错误码： 系统级错误码（用于日志记录等）
 *
 *
 * Created by PhpStorm.
 * User: Darkgel
 * Date: 2018/12/29
 * Time: 16:00
 */

namespace Enum;


final class ErrorCode
{
    /**********************************************成功码0BBCCC**********************************************/
    const SUCCESS                               = 0; //成功



    /********************************************系统级错误码1BBCCC******************************************/

    /***--------------------------通用错误码100CCC--------------------------***/
    const SYSTEM_UNKNOWN_ERROR                  = 100000; //未知系统错误
    const SYSTEM_SIGNATURE_ERROR                = 100001; //签名错误
    const SYSTEM_ILLEGAL_CLIENT                 = 100002; //非法客户端类型
    const SYSTEM_ILLEGAL_HTTP_METHOD            = 100003; //非法的http请求方法
    const SYSTEM_MIS_CONF                       = 100004; //缺少配置
    const SYSTEM_UNKNOWN_TYPE                   = 100005; //未知类型
    const SYSTEM_MISS_PARAM                     = 100006; //缺少参数
    const SYSTEM_NONCE_ERROR                    = 100007; //检测到可能的重放攻击
    const SYSTEM_INVALID_PARAM                  = 100008; //参数不合法
    const SYSTEM_NO_SUCH_OBJECT                 = 100009; //对象不存在

    /***-----------------------数据库相关错误码101CCC------------------------***/
    const SYSTEM_DB_ERROR                       = 101000; //数据库错误
    const SYSTEM_DB_WRITE_ERROR                 = 101001; //数据库读错误
    const SYSTEM_DB_READ_ERROR                  = 101002; //数据库写错误

    /***--------------------外部服务调用相关错误码102CCC---------------------***/
    const SYSTEM_THRIFT_ERROR                   = 102000; //thrift 服务出错

    /***--------------------缓存相关错误码103CCC-----------------------------***/
    const SYSTEM_CACHE_ERROR                    = 103000; //cache错误
    const SYSTEM_CACHE_WRITE_ERROR              = 103001; //cache写失败
    const SYSTEM_CACHE_READ_ERROR               = 103002; //cache读失败
    const SYSTEM_REDIS_ERROR                    = 103003; //redis错误

    /***--------------------消息队列相关错误码104CCC--------------------------***/
    const SYSTEM_MQ_ERROR                       = 104000; //消息队列错误
    const SYSTEM_RABBIT_MQ_ERROR                = 104001; //rabbit mq错误



    /********************************************服务（业务）级错误码2BBCCC********************************************/

    /***--------------------------通用错误码200CCC--------------------------***/
    const BUSINESS_UNKNOWN_ERROR                = 200000; //未知业务级错误
    const BUSINESS_LIMIT_BEYOND                 = 200001; //超过业务限制
    const BUSINESS_INVALID_PARAM                = 200002; //参数不合法
    const BUSINESS_BUSY                         = 200003; //系统繁忙，请稍后重试
    const BUSINESS_TOO_FREQUENT                 = 200004; //请求过于频繁，已经被限制
    const BUSINESS_SERVER_ERROR                 = 200005; //服务器内部错误
    const BUSINESS_CACHE_NOT_FOUND              = 200006; //没有相应的缓存数据
    const BUSINESS_NOT_FOUND                    = 200007; //没有相应的数据

    /***--------------------账号/用户相关错误码201CCC-----------------------***/
    const BUSINESS_INVALID_PHONE                = 201000; //手机号格式不正确
    const BUSINESS_INVALID_EMAIL                = 201001; //邮箱格式不正确
    const BUSINESS_VERIFY_CODE_ERR              = 201002; //验证码错误
    const BUSINESS_ID_CARD_ERR                  = 201003; //身份证错误







    /**
     * @var array $statusTexts code对应的可读信息
     */
    public static $statusTexts = [
        /**********************************************成功码0BBCCC**********************************************/
        0 => 'success',


        /********************************************系统级错误码1BBCCC******************************************/

        /***--------------------------通用错误码100CCC--------------------------***/
        100000 => "未知系统错误",
        100001 => "签名错误",
        100002 => "非法客户端类型",
        100003 => "非法的http请求方法",
        100004 => "缺少配置",
        100005 => "未知类型",
        100006 => "缺少参数",
        100007 => "检测到可能的重放攻击",
        100008 => "参数不合法",
        100009 => "对象不存在",

        /***-----------------------数据库相关错误码101CCC------------------------***/
        101000 => "数据库错误",
        101001 => "数据库读错误",
        101002 => "数据库写错误",

        /***--------------------外部服务调用相关错误码102CCC---------------------***/
        102000 => "thrift 服务出错",

        /***--------------------缓存相关错误码103CCC-----------------------------***/
        103000 => "cache错误",
        103001 => "cache写失败",
        103002 => "cache读失败",
        103003 => "redis错误",

        /***--------------------消息队列相关错误码104CCC--------------------------***/
        104000 => "消息队列错误",
        104001 => "rabbit mq错误",


        /********************************************服务（业务）级错误码2BBCCC********************************************/

        /***--------------------------通用错误码200CCC--------------------------***/
        200000 => "未知业务级错误",
        200001 => "超过业务限制",
        200002 => "参数不合法",
        200003 => "系统繁忙，请稍后重试",
        200004 => "请求过于频繁，已经被限制",
        200005 => "服务器内部错误",
        200006 => "没有相应的缓存数据",
        200007 => "没有相应数据",

        /***--------------------账号/用户相关错误码201CCC-----------------------***/
        201000 => "手机号格式不正确",
        201001 => "邮箱格式不正确",
        201002 => "验证码错误",
        201003 => "身份证错误",
    ];
}
